# Напишите программу,
# которая возводит в третью степень каждое число от 1 до N
# и выводит результат на экран.

n = int(input('введите число '))
num = 0
while n > num:
    num +=1
    s = num ** 3
    print(num,s)