"""Напишите программу, которая возводит
  в третью степень каждое число от 1 до N  и
  выводит результат на экран.
"""

n = int(input('введите число '))
num = 1
# while n >= num:
while num <= n:
    s = num ** 3
    print(num, s)
    num += 1

# i = 0
# i = N
# while ...:
#
#
#     i += 1
#     i -= 1
